import BlackWidowPoster from './../assets/images/Black_widow.jpg'
import Countdown from './../assets/images/Countdown.jpg'
import Tenet from './../assets/images/Tenet.jpg'
import AvengersEndgame from './../assets/images/Avengers_endgame.jpg'
import OutOfTime from './../assets/images/Out_of_time.jpg'
import GreenMile from './../assets/images/Green_mile.jpg'
import ShawshankRedemption from './../assets/images/Shawshank_redemption.jpeg'

export const defaultState = {
    premieres: [
        {
            posterImage: BlackWidowPoster,
            altText: 'Black Widow',
            title: 'Чорна вдова Прем\'єра',
            text: `Боевик «Черная вдова» является сольным фильмом о героине из комиксов Marvel. 
            Лента является 24-й по счету в киновселенной и первой в ее четвертой фазе.
            Действие картины разворачивается сразу после событий, показанных в фильме 
            «Первый мститель: Противостояние», но до того, что произошло в фильме «Мстители: Война бесконечности». 
            Первое появление Черной Вдовы на страницах комиксов состоялась в 1964 году. 
            О том, что данный персонаж заслуживает сольного фильма, начали говорить еще в 2004 году. 
            Именно тогда и состоялся кастинг, на котором роль досталась Скарлетт Йоханссон. 
            С тех пор актриса снялась в восьми фильмах Marvel и только девятый станет ее сольным. 
            Съемки начались в конце мая 2019 в Норвегии.
            `,

        },
        {
            posterImage: Countdown,
            altText: 'Countdown',
            title: 'Зворотній відлік Прем\'єра',
            text: `Молодая медсестра Куинн Харрис ради забавы скачивает на телефон популярное 
            приложение «Обратный отсчет», которое, по утверждениям разработчиков, умеет предсказывать 
            точную дату смерти. Вот только программа отводит девушке всего три дня, после чего ее жизнь 
            оборвется. Она не воспринимает предупреждение всерьез, думая, что числа генерируются 
            случайным образом, но вскоре узнает о реальных жертвах, погибших в указанный час. 
            В надежде обмануть судьбу, Куинн меняет телефон, однако приложение само появляется на новом 
            аппарате, продолжая присылать ей уведомления о приближающейся смерти, что заставляет девушку 
            перейти к более решительным действиям...`,
        },
        {
            posterImage: ShawshankRedemption,
            altText: 'Shawsahnk Redemption',
            title: 'Побіг з Шоушенку Прем\'єра',
            text: `Молодая медсестра Куинн Харрис ради забавы скачивает на телефон популярное 
            приложение «Обратный отсчет», которое, по утверждениям разработчиков, умеет предсказывать 
            точную дату смерти. Вот только программа отводит девушке всего три дня, после чего ее жизнь 
            оборвется. Она не воспринимает предупреждение всерьез, думая, что числа генерируются 
            случайным образом, но вскоре узнает о реальных жертвах, погибших в указанный час. 
            В надежде обмануть судьбу, Куинн меняет телефон, однако приложение само появляется на новом 
            аппарате, продолжая присылать ей уведомления о приближающейся смерти, что заставляет девушку 
            перейти к более решительным действиям...`,
        },
        {
            posterImage: Tenet,
            altText: 'Tenet',
            title: 'Тенет Прем\'єра',
            text: `Молодая медсестра Куинн Харрис ради забавы скачивает на телефон популярное 
            приложение «Обратный отсчет», которое, по утверждениям разработчиков, умеет предсказывать 
            точную дату смерти. Вот только программа отводит девушке всего три дня, после чего ее жизнь 
            оборвется. Она не воспринимает предупреждение всерьез, думая, что числа генерируются 
            случайным образом, но вскоре узнает о реальных жертвах, погибших в указанный час. 
            В надежде обмануть судьбу, Куинн меняет телефон, однако приложение само появляется на новом 
            аппарате, продолжая присылать ей уведомления о приближающейся смерти, что заставляет девушку 
            перейти к более решительным действиям...`,
        },
        {
            posterImage: AvengersEndgame,
            altText: 'Avengers Endgame',
            title: 'Месники. Фінал Прем\'єра',
            text: `Молодая медсестра Куинн Харрис ради забавы скачивает на телефон популярное 
            приложение «Обратный отсчет», которое, по утверждениям разработчиков, умеет предсказывать 
            точную дату смерти. Вот только программа отводит девушке всего три дня, после чего ее жизнь 
            оборвется. Она не воспринимает предупреждение всерьез, думая, что числа генерируются 
            случайным образом, но вскоре узнает о реальных жертвах, погибших в указанный час. 
            В надежде обмануть судьбу, Куинн меняет телефон, однако приложение само появляется на новом 
            аппарате, продолжая присылать ей уведомления о приближающейся смерти, что заставляет девушку 
            перейти к более решительным действиям...`,
        },
        {
            posterImage: OutOfTime,
            altText: 'Out of time',
            title: 'За межами часу Прем\'єра',
            text: `Молодая медсестра Куинн Харрис ради забавы скачивает на телефон популярное 
            приложение «Обратный отсчет», которое, по утверждениям разработчиков, умеет предсказывать 
            точную дату смерти. Вот только программа отводит девушке всего три дня, после чего ее жизнь 
            оборвется. Она не воспринимает предупреждение всерьез, думая, что числа генерируются 
            случайным образом, но вскоре узнает о реальных жертвах, погибших в указанный час. 
            В надежде обмануть судьбу, Куинн меняет телефон, однако приложение само появляется на новом 
            аппарате, продолжая присылать ей уведомления о приближающейся смерти, что заставляет девушку 
            перейти к более решительным действиям...`,
        },
        {
            posterImage: GreenMile,
            altText: 'Green mile',
            title: 'Зелена миля Прем\'єра',
            text: `Молодая медсестра Куинн Харрис ради забавы скачивает на телефон популярное 
            приложение «Обратный отсчет», которое, по утверждениям разработчиков, умеет предсказывать 
            точную дату смерти. Вот только программа отводит девушке всего три дня, после чего ее жизнь 
            оборвется. Она не воспринимает предупреждение всерьез, думая, что числа генерируются 
            случайным образом, но вскоре узнает о реальных жертвах, погибших в указанный час. 
            В надежде обмануть судьбу, Куинн меняет телефон, однако приложение само появляется на новом 
            аппарате, продолжая присылать ей уведомления о приближающейся смерти, что заставляет девушку 
            перейти к более решительным действиям...`,
        },
    ],
    'aug_23': [
        {
            posterImage: GreenMile,
            date: '22.08.2021',
            time: '10:00',
            id: 1,
        },
        {
            posterImage: BlackWidowPoster,
            date: '22.08.2021',
            time: '12:00',
            id: 2,
        },
        {
            posterImage: AvengersEndgame,
            date: '22.08.2021',
            time: '14:00',
            id: 3,
        },
        {
            posterImage: Tenet,
            date: '22.08.2021',
            time: '18:00',
            id: 5,
        },
        {
            posterImage: Countdown,
            date: '22.08.2021',
            time: '20:00',
            id: 6,
        },
    ],
    'aug_24': [
        {
            posterImage: AvengersEndgame,
            date: '23.08.2021',
            time: '10:00',
            id: 7,
        },
        {
            posterImage: GreenMile,
            date: '23.08.2021',
            time: '12:00',
            id: 8,
        },
        {
            posterImage: BlackWidowPoster,
            date: '23.08.2021',
            time: '14:00',
            id: 9,
        },
        {
            posterImage: GreenMile,
            date: '23.08.2021',
            time: '16:00',
            id: 10,
        },
        {
            posterImage: Countdown,
            date: '23.08.2021',
            time: '18:00',
            id: 11,
        },
        {
            posterImage: Tenet,
            date: '23.08.2021',
            time: '20:00',
            id: 12,
        },
    ],
    'aug_25': [
        {
            posterImage: BlackWidowPoster,
            date: '23.08.2021',
            time: '10:00',
            id: 7,
        },
        {
            posterImage: BlackWidowPoster,
            date: '23.08.2021',
            time: '12:00',
            id: 8,
        },
        {
            posterImage: BlackWidowPoster,
            date: '23.08.2021',
            time: '14:00',
            id: 9,
        },
    ],
    'aug_26': [
        {
            posterImage: BlackWidowPoster,
            date: '23.08.2021',
            time: '10:00',
            id: 7,
        },
        {
            posterImage: BlackWidowPoster,
            date: '23.08.2021',
            time: '12:00',
            id: 8,
        },
        {
            posterImage: BlackWidowPoster,
            date: '23.08.2021',
            time: '14:00',
            id: 9,
        },
    ],
    'aug_27': [
        {
            posterImage: BlackWidowPoster,
            date: '23.08.2021',
            time: '10:00',
            id: 7,
        },
        {
            posterImage: BlackWidowPoster,
            date: '23.08.2021',
            time: '12:00',
            id: 8,
        },
        {
            posterImage: BlackWidowPoster,
            date: '23.08.2021',
            time: '14:00',
            id: 9,
        },
    ],
    'aug_28': [
        {
            posterImage: BlackWidowPoster,
            date: '23.08.2021',
            time: '10:00',
            id: 7,
        },
        {
            posterImage: BlackWidowPoster,
            date: '23.08.2021',
            time: '12:00',
            id: 8,
        },
        {
            posterImage: BlackWidowPoster,
            date: '23.08.2021',
            time: '14:00',
            id: 9,
        },
    ]
}